app/Controllers/Home.php

public function send_pesan()
{


    $pesan = $this->request->getVar();
    $data = [
      'pesan' => $pesan
    ];
    if ($pesan['me'] == session('username')){
    $this->pesan->save([ 'pesan' => $this->request->getVar('pesan'),
      'dari' => $pesan['me'], 'ke' => $pesan['username']
    ]);
---
INSERT INTO `pesan` (`pesan`, `dari`, `ke`, `created_at`, `updated_at`) VALUES ('PP', 'zrex24', 'darth', '2023-06-01 01:36:25', '2023-06-01 01:36:25')

public function edit(){
    $rule =['PPMU' => [
      'rules' => 'uploaded[PPMU]|max_size[PPMU,1024]|is_image[PPMU]|mime_in[PPMU,image/jpeg,image/jpg,image/png,image/webp]',
      'errors' => [
        'uploaded' => 'file tidak sesuai',
        'max_size' => 'ukuran file terlalu besar'
      ]]];
    if(!$this->validate($rule)){
      $validate = $this->validator->getErrors();
      return $this->detail(session('username'),$validate);
    }
    $file = $this->request->getFile('PPMU');
    $filename = $file->getRandomName();
    $file->move('img/avatar/',$filename);
    $this->user->set('photoProfile',$filename)->where('username',session('username'))->update();
---
UPDATE `users` SET `photoProfile` = '1685582772_ab38be200237e23a4c68.webp'
WHERE `username` = 'zrex24'