app/Models/user.php

SELECT *
FROM `users`
---
  public function getUser(){
    return $this->findAll();

SELECT *
FROM `users`
WHERE `username` = 'zrex24'
---
  public function getMe($me){
    return $this->where('username',$me)->findAll();